Revit 2027 API
BuiltInFailures.ElectricalFailures.MissingOrInvalidWireSizeTable Property
 Wire Size Table "[Fail Name]" is missing or invalid. Use Electrical Settings to select a valid Wire Size Table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MissingOrInvalidWireSizeTable { get; }
Public Shared ReadOnly Property MissingOrInvalidWireSizeTable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MissingOrInvalidWireSizeTable {
	FailureDefinitionId^ get ();
}
static member MissingOrInvalidWireSizeTable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace